app/controllers/articles_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 19]]
---
  def show
    @comment = @article.comments.build
    @pagy, @comments = pagy @article.comments.order created_at: :desc