app/controllers/comments_controller.rb

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 27], ["LIMIT", 1]]
INSERT INTO "comments" ("author", "body", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["author", "Vasy"], ["body", "Oh"], ["article_id", 28], ["created_at", "2024-07-04 20:48:58.467011"], ["updated_at", "2024-07-04 20:48:58.467011"]]
---
  def create
    @article = Article.find(params[:article_id])
    @article.comments.create(comment_params)