app/controllers/contacts_controller.rb

  def create
    @contact = Contact.new(contact_params)

    if @contact.valid? && valid_email?(@contact.email)
      @contact.save
---
INSERT INTO "contacts" ("email", "message", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["email", "kjkjk"], ["message", "fdfdfd"], ["created_at", "2022-11-14 11:06:05.445357"], ["updated_at", "2022-11-14 11:06:05.445357"]]